# Pandas DataFrame
 It contains data structures and data manipulation tools designed to make data cleaning
and analysis fast and easy in Python. 

## Pandas DataStructures

- Series
- DataFrame
- Panel

### Series
Series is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers,
Python objects, etc.). The axis labels are collectively referred to as the index. The basic method to create a Series is
to call:
>>> s = pd.Series(data, index=index)

In [1]:
import pandas as pd
data = ['Anil','Basanti','Charan','Dolly']
s=pd.Series(data)
print(s)

0       Anil
1    Basanti
2     Charan
3      Dolly
dtype: object


### What is DataFrame?

  A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.

### Features of DataFrame
  - Potentially columns are of different types
  - Size â€“ Mutable
  - Labeled axes (rows and columns)
  - Can Perform Arithmetic operations on rows and columns
  
  
#### Creating a Pandas DataFrame

  
  Pandas DataFrame can be created from various types of data such as
  
  - Lists
  - List of Lists
  - Dictionary
  - List of Dictionary
  - Dict of Series
  - CSV File
  - Excel File
  - SQL Database
  
##### Creating a dataframe using List: 

  DataFrame can be created using a single list or a list of lists.

In [2]:
import pandas as pd
 
# list of strings
lst = ['Anil','Basanti','Charan','Dolly']
 
# Calling DataFrame constructor on list
df = pd.DataFrame(lst)
print(df)

         0
0     Anil
1  Basanti
2   Charan
3    Dolly

In [3]:
import pandas as pd

lst = ['Anil','Basanti','Charan','Dolly']

df = pd.DataFrame(lst, columns=['StudentName'])
print(df)

  StudentName
0        Anil
1     Basanti
2      Charan
3       Dolly

In [4]:
import pandas as pd

lst = ['Anil','Basanti','Charan','Dolly']

df = pd.DataFrame(lst, columns=['StudentName'], index=['Row1','Row2','Row3','Row4'])
print(df)

     StudentName
Row1        Anil
Row2     Basanti
Row3      Charan
Row4       Dolly

### Creating DataFrame using list of lists

In [6]:
import pandas as pd

lst = [['Anil', 98],['Basanti',80],['Charan',99],['Dolly',100]]

df = pd.DataFrame(lst, columns=['StudentName','Marks'])
print(df)

  StudentName  Marks
0        Anil     98
1     Basanti     80
2      Charan     99
3       Dolly    100

### Create a DataFrame from Dict of ndarrays / Lists
  All the ndarrays must be of same length. If index is passed, then the length of the index should equal to the length of the arrays.
If no index is passed, then by default, index will be range(n), where n is the array length.

In [14]:
import pandas as pd
data = {
        'studentName':['Anil','Basanti','Charan','Dolly'],
        'Marks':[98,80,90,100]
       }
df = pd.DataFrame(data)
df

  studentName  Marks
0        Anil     98
1     Basanti     80
2      Charan     90
3       Dolly    100

### Creating DataFrame using List of Dictionary

In [12]:
import pandas as pd

lst = [
        {'StudentName':'Anil','Marks':98},
        {'StudentName':'Basanti','Marks':80},
        {'StudentName':'Charan','Marks':90},
        {'StudentName':'Dolly','Marks':100}
      ]

df = pd.DataFrame(lst)
print(df)

   Marks StudentName
0     98        Anil
1     80     Basanti
2     90      Charan
3    100       Dolly

### Creating DataFrame using Dict of Series

In [13]:
import pandas as pd

data = {
    'StudentName':pd.Series(['Anil','Basanti','Charan','Dolly']),
    'Marks':pd.Series([98,80,90,100])
       }
df=pd.DataFrame(data)
df

  StudentName  Marks
0        Anil     98
1     Basanti     80
2      Charan     90
3       Dolly    100

### Creating a DataFrame from CSV file

In [1]:
import pandas as pd
df = pd.read_csv("nba.csv")
print(df)

                        Name                    Team  Number Position   Age  \
0              Avery Bradley          Boston Celtics     0.0       PG  25.0
1                Jae Crowder          Boston Celtics    99.0       SF  25.0
2               John Holland          Boston Celtics    30.0       SG  27.0
3                R.J. Hunter          Boston Celtics    28.0       SG  22.0
4              Jonas Jerebko          Boston Celtics     8.0       PF  29.0
5               Amir Johnson          Boston Celtics    90.0       PF  29.0
6              Jordan Mickey          Boston Celtics    55.0       PF  21.0
7               Kelly Olynyk          Boston Celtics    41.0        C  25.0
8               Terry Rozier          Boston Celtics    12.0       PG  22.0
9               Marcus Smart          Boston Celtics    36.0       PG  22.0
10           Jared Sullinger          Boston Celtics     7.0        C  24.0
11             Isaiah Thomas          Boston Celtics     4.0       PG  27.0
12               Evan Turner          Boston Celtics    11.0       SG  27.0
13               James Young          Boston Celtics    13.0       SG  20.0
14              Tyler Zeller          Boston Celtics    44.0        C  26.0
15          Bojan Bogdanovic           Brooklyn Nets    44.0       SG  27.0
16              Markel Brown           Brooklyn Nets    22.0       SG  24.0
17           Wayne Ellington           Brooklyn Nets    21.0       SG  28.0
18   Rondae Hollis-Jefferson           Brooklyn Nets    24.0       SG  21.0
19              Jarrett Jack           Brooklyn Nets     2.0       PG  32.0
20            Sergey Karasev           Brooklyn Nets    10.0       SG  22.0
21           Sean Kilpatrick           Brooklyn Nets     6.0       SG  26.0
22              Shane Larkin           Brooklyn Nets     0.0       PG  23.0
23               Brook Lopez           Brooklyn Nets    11.0        C  28.0
24          Chris McCullough           Brooklyn Nets     1.0       PF  21.0
25               Willie Reed           Brooklyn Nets    33.0       PF  26.0
26           Thomas Robinson           Brooklyn Nets    41.0       PF  25.0
27                Henry Sims           Brooklyn Nets    14.0        C  26.0
28              Donald Sloan           Brooklyn Nets    15.0       PG  28.0
29            Thaddeus Young           Brooklyn Nets    30.0       PF  27.0
..                       ...                     ...     ...      ...   ...
428          Al-Farouq Aminu  Portland Trail Blazers     8.0       SF  25.0
429          Pat Connaughton  Portland Trail Blazers     5.0       SG  23.0
430             Allen Crabbe  Portland Trail Blazers    23.0       SG  24.0
431                 Ed Davis  Portland Trail Blazers    17.0        C  27.0
432         Maurice Harkless  Portland Trail Blazers     4.0       SF  23.0
433         Gerald Henderson  Portland Trail Blazers     9.0       SG  28.0
434              Chris Kaman  Portland Trail Blazers    35.0        C  34.0
435           Meyers Leonard  Portland Trail Blazers    11.0       PF  24.0
436           Damian Lillard  Portland Trail Blazers     0.0       PG  25.0
437            C.J. McCollum  Portland Trail Blazers     3.0       SG  24.0
438             Luis Montero  Portland Trail Blazers    44.0       SG  23.0
439            Mason Plumlee  Portland Trail Blazers    24.0        C  26.0
440            Brian Roberts  Portland Trail Blazers     2.0       PG  30.0
441              Noah Vonleh  Portland Trail Blazers    21.0       PF  20.0
442            Trevor Booker               Utah Jazz    33.0       PF  28.0
443               Trey Burke               Utah Jazz     3.0       PG  23.0
444               Alec Burks               Utah Jazz    10.0       SG  24.0
445               Dante Exum               Utah Jazz    11.0       PG  20.0
446           Derrick Favors               Utah Jazz    15.0       PF  24.0
447              Rudy Gobert               Utah Jazz    27.0        C  23.0
448           Gordon Hayward               Utah Jazz    20.0       SF  26.0
449              Rodney Hood               Utah Jazz     5.0       SG  23.0
450               Joe Ingles               Utah Jazz     2.0       SF  28.0
451            Chris Johnson               Utah Jazz    23.0       SF  26.0
452               Trey Lyles               Utah Jazz    41.0       PF  20.0
453             Shelvin Mack               Utah Jazz     8.0       PG  26.0
454                Raul Neto               Utah Jazz    25.0       PG  24.0
455             Tibor Pleiss               Utah Jazz    21.0        C  26.0
456              Jeff Withey               Utah Jazz    24.0        C  26.0
457                      NaN                     NaN     NaN      NaN   NaN

    Height  Weight            College      Salary
0      6-2   180.0              Texas   7730337.0
1      6-6   235.0          Marquette   6796117.0
2      6-5   205.0  Boston University         NaN
3      6-5   185.0      Georgia State   1148640.0
4     6-10   231.0                NaN   5000000.0
5      6-9   240.0                NaN  12000000.0
6      6-8   235.0                LSU   1170960.0
7      7-0   238.0            Gonzaga   2165160.0
8      6-2   190.0         Louisville   1824360.0
9      6-4   220.0     Oklahoma State   3431040.0
10     6-9   260.0         Ohio State   2569260.0
11     5-9   185.0         Washington   6912869.0
12     6-7   220.0         Ohio State   3425510.0
13     6-6   215.0           Kentucky   1749840.0
14     7-0   253.0     North Carolina   2616975.0
15     6-8   216.0                NaN   3425510.0
16     6-3   190.0     Oklahoma State    845059.0
17     6-4   200.0     North Carolina   1500000.0
18     6-7   220.0            Arizona   1335480.0
19     6-3   200.0       Georgia Tech   6300000.0
20     6-7   208.0                NaN   1599840.0
21     6-4   219.0         Cincinnati    134215.0
22    5-11   175.0         Miami (FL)   1500000.0
23     7-0   275.0           Stanford  19689000.0
24    6-11   200.0           Syracuse   1140240.0
25    6-10   220.0        Saint Louis    947276.0
26    6-10   237.0             Kansas    981348.0
27    6-10   248.0         Georgetown    947276.0
28     6-3   205.0          Texas A&M    947276.0
29     6-8   221.0       Georgia Tech  11235955.0
..     ...     ...                ...         ...
428    6-9   215.0        Wake Forest   8042895.0
429    6-5   206.0         Notre Dame    625093.0
430    6-6   210.0         California    947276.0
431   6-10   240.0     North Carolina   6980802.0
432    6-9   215.0         St. John's   2894059.0
433    6-5   215.0               Duke   6000000.0
434    7-0   265.0   Central Michigan   5016000.0
435    7-1   245.0           Illinois   3075880.0
436    6-3   195.0        Weber State   4236287.0
437    6-4   200.0             Lehigh   2525160.0
438    6-7   185.0     Westchester CC    525093.0
439   6-11   235.0               Duke   1415520.0
440    6-1   173.0             Dayton   2854940.0
441    6-9   240.0            Indiana   2637720.0
442    6-8   228.0            Clemson   4775000.0
443    6-1   191.0           Michigan   2658240.0
444    6-6   214.0           Colorado   9463484.0
445    6-6   190.0                NaN   3777720.0
446   6-10   265.0       Georgia Tech  12000000.0
447    7-1   245.0                NaN   1175880.0
448    6-8   226.0             Butler  15409570.0
449    6-8   206.0               Duke   1348440.0
450    6-8   226.0                NaN   2050000.0
451    6-6   206.0             Dayton    981348.0
452   6-10   234.0           Kentucky   2239800.0
453    6-3   203.0             Butler   2433333.0
454    6-1   179.0                NaN    900000.0
455    7-3   256.0                NaN   2900000.0
456    7-0   231.0             Kansas    947276.0
457    NaN     NaN                NaN         NaN

[458 rows x 9 columns]

In [4]:
pip install xlrd

Requirement already satisfied: xlrd in /srv/conda/envs/notebook/lib/python3.7/site-packages (1.2.0)
Note: you may need to restart the kernel to use updated packages.

### Creating a DataFrame from an Excel file

In [5]:
import pandas as pd

df = pd.read_excel("Data - Single Worksheet.xlsx")
print(df)

   FirstName LastName           City Gender
0    Brandon    James          Miami      M
1       Sean  Hawkins         Denver      M
2       Judy      Day    Los Angeles      F
3     Ashley     Ruiz  San Francisco      F
4  Stephanie    Gomez       Portland      F

## Attributes of DataFrame

#### Head()

In [23]:
nba = pd.read_csv("nba.csv")
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [24]:
nba.head(1)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0

#### tail()

In [25]:
nba.tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [28]:
import pandas as pd

lst = [['Anil', 98],['Basanti',80],['Charan',99],['Dolly',100]]

df = pd.DataFrame(lst, columns=['StudentName','Marks'])
df

  StudentName  Marks
0        Anil     98
1     Basanti     80
2      Charan     99
3       Dolly    100

#### DataFrame Transpose

In [37]:
df.T

                0        1       2      3
StudentName  Anil  Basanti  Charan  Dolly
Marks          98       80      99    100

#### index

In [29]:
df.index

RangeIndex(start=0, stop=4, step=1)

#### values

In [30]:
df.values

array([['Anil', 98],
       ['Basanti', 80],
       ['Charan', 99],
       ['Dolly', 100]], dtype=object)

#### Shape

In [31]:
df.shape

(4, 2)

#### dtypes

In [32]:
df.dtypes

StudentName    object
Marks           int64
dtype: object

#### columns

In [34]:
df.columns

Index(['StudentName', 'Marks'], dtype='object')

#### axes

In [35]:
df.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['StudentName', 'Marks'], dtype='object')]

#### info

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
StudentName    4 non-null object
Marks          4 non-null int64
dtypes: int64(1), object(1)
memory usage: 88.0+ bytes

## Select One Column from a `DataFrame`

In [40]:
import pandas as pd
data=[['Anil',90,'A','Very Good'],['Basanti',89,'A-','Good'],['Charan',70,'B-','Average'],['Dolly',40,'D+','Below_Avereage'],
      ['Emily',68,'B-','Average'],['Fani',99,'A+','Awesome'],['goutham',29,'F','Bad'],['Hannah',55,'C+','Below_Average']]
df=pd.DataFrame(data,columns=['StudentName','Marks','Grade','Remarks'])
df

  StudentName  Marks Grade         Remarks
0        Anil     90     A       Very Good
1     Basanti     89    A-            Good
2      Charan     70    B-         Average
3       Dolly     40    D+  Below_Avereage
4       Emily     68    B-         Average
5        Fani     99    A+         Awesome
6     goutham     29     F             Bad
7      Hannah     55    C+   Below_Average

In [42]:
df['StudentName']

0       Anil
1    Basanti
2     Charan
3      Dolly
4      Emily
5       Fani
6    goutham
7     Hannah
Name: StudentName, dtype: object

In [43]:
df['Grade']

0     A
1    A-
2    B-
3    D+
4    B-
5    A+
6     F
7    C+
Name: Grade, dtype: object

### Selecting multiple columns of a DataFrame

In [52]:
df[['StudentName','Grade']]

  StudentName Grade
0        Anil     A
1     Basanti    A-
2      Charan    B-
3       Dolly    D+
4       Emily    B-
5        Fani    A+
6     goutham     F
7      Hannah    C+

In [63]:
lst_colmns = ['Marks','Remarks']
df[lst_colmns]

   Marks         Remarks
0     90       Very Good
1     89            Good
2     70         Average
3     40  Below_Avereage
4     68         Average
5     99         Awesome
6     29             Bad
7     55   Below_Average

In [50]:
df[df.columns[0:3]]

  StudentName  Marks Grade
0        Anil     90     A
1     Basanti     89    A-
2      Charan     70    B-
3       Dolly     40    D+
4       Emily     68    B-
5        Fani     99    A+
6     goutham     29     F
7      Hannah     55    C+

In [55]:
df[df.columns[0:2]]

  StudentName  Marks
0        Anil     90
1     Basanti     89
2      Charan     70
3       Dolly     40
4       Emily     68
5        Fani     99
6     goutham     29
7      Hannah     55

### selecting rows in a DataFrame

In [56]:
df[df.columns[0:2]].head(3)

  StudentName  Marks
0        Anil     90
1     Basanti     89
2      Charan     70

In [57]:
df[df.columns[0:2]].tail(3)

  StudentName  Marks
5        Fani     99
6     goutham     29
7      Hannah     55

In [58]:
df[df.columns[0:2]][3:5]

  StudentName  Marks
3       Dolly     40
4       Emily     68

In [62]:
df[2:7]

  StudentName  Marks Grade         Remarks
2      Charan     70    B-         Average
3       Dolly     40    D+  Below_Avereage
4       Emily     68    B-         Average
5        Fani     99    A+         Awesome
6     goutham     29     F             Bad

#### .loc()

In [32]:
df.loc[0:5]

  StudentName  Marks Grade         Remarks Branch University       City Sex
0        Anil     90     A       Very Good    ECE       IIPL  Hyderabad   M
1     Basanti     89    A-            Good    CSE       IIPL  Hyderabad   F
2      Charan     70    B-         Average   MECH       IIPL  Hyderabad   M
3       Dolly     40    D+  Below_Avereage  CIVIL       IIPL  Hyderabad   F
4       Emily     68    B-         Average    EEE       IIPL  Hyderabad   F
5        Fani     99    A+         Awesome     IT       IIPL  Hyderabad   M

In [31]:
df.loc[[3,7]]

  StudentName  Marks Grade         Remarks Branch University       City Sex
3       Dolly     40    D+  Below_Avereage  CIVIL       IIPL  Hyderabad   F
7      Hannah     55    C+   Below_Average    ECE       IIPL  Hyderabad   F

In [33]:
df.loc[[3,7],['StudentName','City']]

  StudentName       City
3       Dolly  Hyderabad
7      Hannah  Hyderabad

In [34]:
df.loc[[3],['Branch']]

  Branch
3  CIVIL

### Add New Column to `DataFrame`

In [7]:
import pandas as pd
nba = pd.read_csv("nba.csv")
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [8]:
nba["Sport"] = "Basketball"
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Sport
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,Basketball
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,Basketball
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,Basketball

In [9]:
nba["League"] = "National Basketball Association"
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Sport,League
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,Basketball,National Basketball Association
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,Basketball,National Basketball Association
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,Basketball,National Basketball Association

In [10]:
nba = pd.read_csv("nba.csv")
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [11]:
nba.insert(3, column = "Sport", value = "Basketball")
nba.head(3)

,Name,Team,Number,Sport,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,Basketball,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,Basketball,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,Basketball,SG,27.0,6-5,205.0,Boston University,NaN

In [12]:
nba.insert(7, column = "League", value = "National Basketball Association")
nba.head(3)

,Name,Team,Number,Sport,Position,Age,Height,League,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,Basketball,PG,25.0,6-2,National Basketball Association,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,Basketball,SF,25.0,6-6,National Basketball Association,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,Basketball,SG,27.0,6-5,National Basketball Association,205.0,Boston University,NaN

## Methods of DataFrame

### Arithmetic  Operations

In [39]:
import pandas as pd
nba = pd.read_csv("nba.csv")
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,2-Jun,180,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99,SF,25,6-Jun,235,Marquette,6796117.0
2,John Holland,Boston Celtics,30,SG,27,5-Jun,205,Boston University,NaN

In [42]:
nba["Age"]=nba["Age"].add(5)
nba["Age"] + 5

nba["Salary"].sub(5000000)
nba["Salary"] - 5000000

nba["Weight"].mul(0.453592)
nba["Weight in Kilograms"] = nba["Weight"] * 0.453592

In [43]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Weight in Kilograms
0,Avery Bradley,Boston Celtics,0,PG,30,2-Jun,180,Texas,7730337.0,81.64656
1,Jae Crowder,Boston Celtics,99,SF,30,6-Jun,235,Marquette,6796117.0,106.59412
2,John Holland,Boston Celtics,30,SG,32,5-Jun,205,Boston University,NaN,92.98636

In [119]:
nba["Salary"].div(1000000)
nba["Salary in Millions"] = nba["Salary"] / 1000000

In [120]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Weight in Kilograms,Salary in Millions
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0,81.64656,7.730337
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0,106.59412,6.796117
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN,92.98636,NaN

### A Review of the `.value_counts()` Method

In [1]:
import pandas as pd
nba = pd.read_csv("nba.csv")
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [2]:
nba["Team"].value_counts()
nba["Position"].value_counts().head(1)
nba["Weight"].value_counts().tail()
nba["Salary"].value_counts()

947276.0      31
845059.0      18
525093.0      13
981348.0       6
1100602.0      5
16407500.0     5
5000000.0      5
12000000.0     5
8000000.0      5
4000000.0      5
3000000.0      4
7000000.0      4
2814000.0      4
1000000.0      4
19689000.0     4
200600.0       3
8500000.0      3
2500000.0      3
1015421.0      3
2854940.0      3
13500000.0     3
5543725.0      3
2288205.0      2
1270964.0      2
2900000.0      2
1007026.0      2
111444.0       2
13000000.0     2
1500000.0      2
1842000.0      2
              ..
2239800.0      1
1474440.0      1
19688000.0     1
7900000.0      1
2008748.0      1
13800000.0     1
2841960.0      1
1404600.0      1
1584480.0      1
273038.0       1
9213483.0      1
3272091.0      1
3075880.0      1
2250000.0      1
4626960.0      1
1304520.0      1
12100000.0     1
7500000.0      1
295327.0       1
2836186.0      1
6486486.0      1
5016000.0      1
3333333.0      1
1824360.0      1
8042895.0      1
1242720.0      1
2489530.0      1
5103120.0      1
9463484.0      1
700902.0       1
Name: Salary, Length: 309, dtype: int64

### Drop Rows/Columns with Null Values

#### dropna()

##### Parameters :


axis -  {0 or â€˜indexâ€™, 1 or â€˜columnsâ€™}, default 0
		Determine if rows or columns which contain missing values are removed.

		0, or â€˜indexâ€™ : Drop rows which contain missing values.

		1, or â€˜columnsâ€™ : Drop columns which contain missing value.

how	-	{â€˜anyâ€™, â€˜allâ€™}, default â€˜anyâ€™
		Determine if row or column is removed from DataFrame, when we have at least one NA or all NA.

		â€˜anyâ€™ : If any NA values are present, drop that row or column.

		â€˜allâ€™ : If all values are NA, drop that row or column.

thresh - int optional

		Specifies the minimum number of non-NA values in row/column in order for it to be considered in the final result. Any row/column with the number of non-NA values < thresh value is removed irrespective of other parameters passed. When thresh=none, this filter is ignored

subset - array-like, optional
		Labels along other axis to consider, e.g. if you are dropping rows these would be a list of columns to include.

inplace - bool, default False
		If True, do operation inplace and return None.

In [44]:
nba = pd.read_csv("nba.csv")
nba.tail(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
454,Raul Neto,Utah Jazz,25,PG,24,1-Jun,179,NaN,NaN
455,Tibor Pleiss,Utah Jazz,21,C,26,3-Jul,256,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24,C,26,Jul-00,231,Kansas,947276.0

In [49]:
nba.dropna(how = "all", inplace = True)

In [50]:
nba.tail(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
454,Raul Neto,Utah Jazz,25,PG,24,1-Jun,179,NaN,NaN
455,Tibor Pleiss,Utah Jazz,21,C,26,3-Jul,256,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24,C,26,Jul-00,231,Kansas,947276.0

In [45]:
nba.dropna(subset = ["Salary", "College"])
nba.tail(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
454,Raul Neto,Utah Jazz,25,PG,24,1-Jun,179,NaN,NaN
455,Tibor Pleiss,Utah Jazz,21,C,26,3-Jul,256,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24,C,26,Jul-00,231,Kansas,947276.0

### Fill in Null Values with the `.fillna()` Method

This method allows us to replace the NULL values with any value

In [2]:
import pandas as pd
nba = pd.read_csv("nba.csv")
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,2-Jun,180,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99,SF,25,6-Jun,235,Marquette,6796117.0
2,John Holland,Boston Celtics,30,SG,27,5-Jun,205,Boston University,NaN

In [3]:
nba.fillna(0)
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,2-Jun,180,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99,SF,25,6-Jun,235,Marquette,6796117.0
2,John Holland,Boston Celtics,30,SG,27,5-Jun,205,Boston University,NaN

In [6]:
nba["Salary"].fillna(0, inplace = True)
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,2-Jun,180,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99,SF,25,6-Jun,235,Marquette,6796117.0
2,John Holland,Boston Celtics,30,SG,27,5-Jun,205,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28,SG,22,5-Jun,185,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8,PF,29,10-Jun,231,NaN,5000000.0

In [7]:
nba["College"].fillna("No College", inplace = True)
nba.head()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,2-Jun,180,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99,SF,25,6-Jun,235,Marquette,6796117.0
2,John Holland,Boston Celtics,30,SG,27,5-Jun,205,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28,SG,22,5-Jun,185,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8,PF,29,10-Jun,231,No College,5000000.0

### The `.astype()` Method

This method is used to cast a pandas object to a specified dtype.This method also provides the capability to convert any suitable existing column to categorical type.

In [7]:
import pandas as pd
nba = pd.read_csv("nba.csv").dropna(how = "all")
nba["Salary"].fillna(0, inplace = True)
nba["College"].fillna("None", inplace = True)
nba.head(6)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,0.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,None,5000000.0
5,Amir Johnson,Boston Celtics,90.0,PF,29.0,6-9,240.0,None,12000000.0

In [8]:
nba.dtypes
nba.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 457 entries, 0 to 456
Data columns (total 9 columns):
Name        457 non-null object
Team        457 non-null object
Number      457 non-null float64
Position    457 non-null object
Age         457 non-null float64
Height      457 non-null object
Weight      457 non-null float64
College     457 non-null object
Salary      457 non-null float64
dtypes: float64(4), object(5)
memory usage: 35.7+ KB

In [9]:
nba["Salary"] = nba["Salary"].astype("int")

In [13]:
nba.dtypes

Name        object
Team        object
Number       int64
Position    object
Age          int64
Height      object
Weight       int64
College     object
Salary       int32
dtype: object

In [11]:
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0,PG,25,2-Jun,180,Texas,7730337
1,Jae Crowder,Boston Celtics,99,SF,25,6-Jun,235,Marquette,6796117
2,John Holland,Boston Celtics,30,SG,27,5-Jun,205,Boston University,0

In [10]:
nba["Number"] = nba["Number"].astype("int")
nba["Age"] = nba["Age"].astype("int")
nba.dtypes

Name         object
Team         object
Number        int64
Position     object
Age           int64
Height       object
Weight      float64
College      object
Salary        int64
dtype: object

In [16]:
nba["Age"].astype("float")
nba.dtypes

Name        object
Team        object
Number       int32
Position    object
Age          int32
Height      object
Weight       int64
College     object
Salary       int32
dtype: object

In [21]:
nba["Position"] = nba["Position"].astype("category")
nba["Team"] = nba["Team"].astype("category")
nba.dtypes

Name          object
Team        category
Number         int32
Position    category
Age            int32
Height        object
Weight         int64
College       object
Salary         int32
dtype: object

### nunique() method 

nunique() function return Series with number of distinct observations over requested axis. If we set the value of axis to be 0, then it finds the total number of unique observations over the index axis.

In [4]:
nba["Position"].nunique()

5

In [11]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 457 entries, 0 to 456
Data columns (total 9 columns):
Name        457 non-null object
Team        457 non-null object
Number      457 non-null int64
Position    457 non-null object
Age         457 non-null int64
Height      457 non-null object
Weight      457 non-null float64
College     457 non-null object
Salary      457 non-null int64
dtypes: float64(1), int64(3), object(5)
memory usage: 35.7+ KB

In [12]:
nba["Position"] = nba["Position"].astype("category")

In [13]:
nba["Team"] = nba["Team"].astype("category")

In [14]:
nba.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 457 entries, 0 to 456
Data columns (total 9 columns):
Name        457 non-null object
Team        457 non-null category
Number      457 non-null int64
Position    457 non-null category
Age         457 non-null int64
Height      457 non-null object
Weight      457 non-null float64
College     457 non-null object
Salary      457 non-null int64
dtypes: category(2), float64(1), int64(3), object(3)
memory usage: 31.1+ KB

### Sort a `DataFrame` with the `.sort_values()` Method

Parameters
by	-	str or list of str
		Name or list of names to sort by.

		if axis is 0 or â€˜indexâ€™ then by may contain index levels and/or column labels.

		if axis is 1 or â€˜columnsâ€™ then by may contain column levels and/or index labels.

axis - {0 or â€˜indexâ€™, 1 or â€˜columnsâ€™}, default 0
		Axis to be sorted.

ascending - bool or list of bool, default True
			Sort ascending vs. descending. Specify list for multiple sort orders. If this is a list of bools, must match the length of the by.

inplace - bool, default False
		If True, perform operation in-place.

kind - {â€˜quicksortâ€™, â€˜mergesortâ€™, â€˜heapsortâ€™}, default â€˜quicksortâ€™

na_position - {â€˜firstâ€™, â€˜lastâ€™}, default â€˜lastâ€™
			  Puts NaNs at the beginning if first; last puts NaNs at the end.

ignore_index - bool, default False
			If True, the resulting axis will be labeled 0, 1, â€¦, n - 1.

In [1]:
import pandas as pd
nba = pd.read_csv("nba.csv")
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [15]:
nba.sort_values("Salary", ascending = False, na_position = "first").tail()

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
175,Jordan McRae,Cleveland Cavaliers,12.0,SG,25.0,6-5,179.0,Tennessee,111196.0
135,Alan Williams,Phoenix Suns,15.0,C,23.0,6-8,260.0,UC Santa Barbara,83397.0
291,Orlando Johnson,New Orleans Pelicans,0.0,SG,27.0,6-5,220.0,UC Santa Barbara,55722.0
130,Phil Pressey,Phoenix Suns,25.0,PG,25.0,5-11,175.0,Missouri,55722.0
32,Thanasis Antetokounmpo,New York Knicks,43.0,SF,23.0,6-7,205.0,NaN,30888.0

In [3]:
nba.sort_values(["Team", "Name"], ascending = [True, False], inplace = True)
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
322,Walter Tavares,Atlanta Hawks,22.0,C,24.0,7-3,260.0,NaN,1000000.0
310,Tim Hardaway Jr.,Atlanta Hawks,10.0,SG,24.0,6-6,205.0,Michigan,1304520.0
321,Tiago Splitter,Atlanta Hawks,11.0,C,31.0,6-11,245.0,NaN,9756250.0

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-03-25 12:42:00,97308,6.945,True,Marketing
21,Matthew,Male,1995-09-05,2020-03-25 02:12:00,100612,13.645,False,Marketing
26,Craig,Male,2000-02-27,2020-03-25 07:45:00,37598,7.757,True,Marketing
74,Thomas,Male,1995-06-04,2020-03-25 14:24:00,62096,17.029,False,Marketing
77,Charles,Male,2004-09-14,2020-03-25 20:13:00,107391,1.260,True,Marketing

### Sort `DataFrame` with the `.sort_index()` Method

In [4]:
nba = pd.read_csv("nba.csv")
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [8]:
nba.sort_values(["Number", "Salary", "Name"], inplace = True)
nba.tail(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
68,Lucas Nogueira,Toronto Raptors,92.0,C,23.0,7-0,220.0,NaN,1842000.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [9]:
nba.sort_index(ascending = False, inplace = True)
nba.head(3)

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0

### Filter A `DataFrame`

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("employees.csv", parse_dates = ["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-03-25 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-03-25 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-03-25 11:17:00,130590,11.858,False,Finance

In [3]:
mask1 = df["Gender"] == "Male"
mask2 = df["Team"] == "Marketing"

df[mask1 & mask2].head(5)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-03-25 12:42:00,97308,6.945,True,Marketing
21,Matthew,Male,1995-09-05,2020-03-25 02:12:00,100612,13.645,False,Marketing
26,Craig,Male,2000-02-27,2020-03-25 07:45:00,37598,7.757,True,Marketing
74,Thomas,Male,1995-06-04,2020-03-25 14:24:00,62096,17.029,False,Marketing
77,Charles,Male,2004-09-14,2020-03-25 20:13:00,107391,1.260,True,Marketing

### The `.isin()` , `.isnull()` , `.notnull()` and `.between()` Methods

In [4]:
filter1 = df["Gender"].isin(["Female"]) 
filter2 = df["Team"].isin(["Engineering", "Distribution", "Finance" ])
df[filter1 & filter2].head(5)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
2,Maria,Female,1993-04-23,2020-03-25 11:17:00,130590,11.858,False,Finance
7,NaN,Female,2015-07-20,2020-03-25 10:43:00,45906,11.598,True,Finance
8,Angela,Female,2005-11-22,2020-03-25 06:29:00,95570,18.523,True,Engineering
14,Kimberly,Female,1999-01-14,2020-03-25 07:13:00,41426,14.543,True,Finance
30,Christina,Female,2002-08-06,2020-03-25 13:19:00,118780,9.096,True,Engineering

In [5]:
mask = df["Team"].isnull()

df[mask]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2020-03-25 06:53:00,61933,4.170,True,NaN
10,Louise,Female,1980-08-12,2020-03-25 09:01:00,63241,15.132,True,NaN
23,NaN,Male,2012-06-14,2020-03-25 16:19:00,125792,5.042,True,NaN
32,NaN,Male,1998-08-21,2020-03-25 14:27:00,122340,6.417,True,NaN
91,James,NaN,2005-01-26,2020-03-25 23:00:00,128771,8.309,False,NaN
109,Christopher,Male,2000-04-22,2020-03-25 10:15:00,37919,11.449,False,NaN
139,NaN,Female,1990-10-03,2020-03-25 01:08:00,132373,10.527,True,NaN
199,Jonathan,Male,2009-07-17,2020-03-25 08:15:00,130581,16.736,True,NaN
258,Michael,Male,2002-01-24,2020-03-25 03:04:00,43586,12.659,False,NaN
290,Jeremy,Male,1988-06-14,2020-03-25 18:20:00,129460,13.657,True,NaN
314,Bobby,Male,1996-03-31,2020-03-25 17:40:00,112117,6.338,False,NaN
367,Edward,Male,1989-08-04,2020-03-25 06:06:00,66067,10.957,True,NaN
382,NaN,Female,1996-04-18,2020-03-25 15:57:00,107024,12.182,True,NaN
434,Joyce,Female,1995-02-07,2020-03-25 07:38:00,50701,14.227,True,NaN
438,Jason,Male,1998-11-20,2020-03-25 14:54:00,69244,6.220,True,NaN
445,Chris,Male,2006-12-12,2020-03-25 01:57:00,71642,1.496,False,NaN
479,Richard,Male,1997-07-04,2020-03-25 11:47:00,47647,18.787,True,NaN
512,Wanda,Female,1993-04-06,2020-03-25 03:11:00,78883,19.695,False,NaN
513,Jimmy,Male,2013-11-19,2020-03-25 19:29:00,63549,19.624,False,NaN
520,Peter,Male,2003-02-22,2020-03-25 09:09:00,56580,8.411,True,NaN
567,NaN,Female,1980-04-01,2020-03-25 20:04:00,48141,12.605,True,NaN
573,Kimberly,Female,1981-12-30,2020-03-25 04:51:00,81800,5.435,True,NaN
580,Harry,Male,1985-01-27,2020-03-25 20:18:00,65482,18.089,False,NaN
626,NaN,Female,1997-04-13,2020-03-25 08:03:00,131755,2.930,True,NaN
634,Carl,Male,1987-03-30,2020-03-25 17:59:00,75598,19.289,False,NaN
635,Randy,Male,2000-09-27,2020-03-25 03:04:00,89831,13.047,True,NaN
647,Donald,Male,1988-04-06,2020-03-25 10:00:00,122920,5.320,False,NaN
669,Joseph,NaN,1982-03-28,2020-03-25 13:05:00,86564,11.879,True,NaN
684,Alice,Female,2016-01-21,2020-03-25 17:07:00,117787,10.485,False,NaN
706,Todd,Male,1993-07-04,2020-03-25 18:53:00,128175,18.473,True,NaN
726,Daniel,Male,2016-02-29,2020-03-25 04:04:00,77287,13.000,True,NaN
753,Antonio,Male,1999-06-06,2020-03-25 22:54:00,41928,5.478,True,NaN
774,NaN,Female,2000-06-18,2020-03-25 07:36:00,106428,10.867,True,NaN
781,Lawrence,Male,1995-07-03,2020-03-25 22:55:00,46378,9.127,False,NaN
794,Nicole,Female,2004-03-01,2020-03-25 17:17:00,44021,10.286,False,NaN
826,NaN,NaN,1988-08-01,2020-03-25 01:35:00,87103,5.665,True,NaN
850,Charles,Male,1997-09-03,2020-03-25 10:04:00,148291,6.002,False,NaN
851,Bobby,Male,1996-08-19,2020-03-25 01:16:00,147842,16.158,True,NaN
853,Mildred,Female,2007-04-06,2020-03-25 22:06:00,139284,11.390,True,NaN
855,Phillip,NaN,2003-10-20,2020-03-25 11:09:00,89700,2.277,True,NaN
864,Ryan,Male,2012-11-16,2020-03-25 13:47:00,57292,6.010,False,NaN
912,Joe,Male,1998-12-08,2020-03-25 10:28:00,126120,1.020,False,NaN
951,NaN,Female,2010-09-14,2020-03-25 05:19:00,143638,9.662,True,NaN

In [6]:
condition = df["Gender"].notnull()

df[condition]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,1993-08-06,2020-03-25 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2020-03-25 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2020-03-25 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2020-03-25 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2020-03-25 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2020-03-25 01:35:00,115163,10.125,False,Legal
6,Ruby,Female,1987-08-17,2020-03-25 16:20:00,65476,10.012,True,Product
7,NaN,Female,2015-07-20,2020-03-25 10:43:00,45906,11.598,True,Finance
8,Angela,Female,2005-11-22,2020-03-25 06:29:00,95570,18.523,True,Engineering
9,Frances,Female,2002-08-08,2020-03-25 06:51:00,139852,7.524,True,Business Development
10,Louise,Female,1980-08-12,2020-03-25 09:01:00,63241,15.132,True,NaN
11,Julie,Female,1997-10-26,2020-03-25 15:19:00,102508,12.637,True,Legal
12,Brandon,Male,1980-12-01,2020-03-25 01:08:00,112807,17.492,True,Human Resources
13,Gary,Male,2008-01-27,2020-03-25 23:40:00,109831,5.831,False,Sales
14,Kimberly,Female,1999-01-14,2020-03-25 07:13:00,41426,14.543,True,Finance
15,Lillian,Female,2016-06-05,2020-03-25 06:09:00,59414,1.256,False,Product
16,Jeremy,Male,2010-09-21,2020-03-25 05:56:00,90370,7.369,False,Human Resources
17,Shawn,Male,1986-12-07,2020-03-25 19:45:00,111737,6.414,False,Product
18,Diana,Female,1981-10-23,2020-03-25 10:27:00,132940,19.082,False,Client Services
19,Donna,Female,2010-07-22,2020-03-25 03:48:00,81014,1.894,False,Product
21,Matthew,Male,1995-09-05,2020-03-25 02:12:00,100612,13.645,False,Marketing
23,NaN,Male,2012-06-14,2020-03-25 16:19:00,125792,5.042,True,NaN
24,John,Male,1992-07-01,2020-03-25 22:08:00,97950,13.873,False,Client Services
25,NaN,Male,2012-10-08,2020-03-25 01:12:00,37076,18.576,True,Client Services
26,Craig,Male,2000-02-27,2020-03-25 07:45:00,37598,7.757,True,Marketing
28,Terry,Male,1981-11-27,2020-03-25 18:30:00,124008,13.464,True,Client Services
29,Benjamin,Male,2005-01-26,2020-03-25 22:06:00,79529,7.008,True,Legal
30,Christina,Female,2002-08-06,2020-03-25 13:19:00,118780,9.096,True,Engineering
32,NaN,Male,1998-08-21,2020-03-25 14:27:00,122340,6.417,True,NaN
33,Jean,Female,1993-12-18,2020-03-25 09:07:00,119082,16.180,False,Business Development
...,...,...,...,...,...,...,...,...
966,Louis,Male,2011-08-16,2020-03-25 17:19:00,93022,9.146,True,Human Resources
967,Thomas,Male,2016-03-12,2020-03-25 15:10:00,105681,19.572,False,Engineering
968,Louise,Female,1995-03-27,2020-03-25 22:27:00,43050,11.671,False,Distribution
969,Linda,Female,2010-02-04,2020-03-25 20:49:00,44486,17.308,True,Engineering
970,Alice,Female,1988-09-03,2020-03-25 20:54:00,63571,15.397,True,Product
971,Patrick,Male,2002-12-30,2020-03-25 02:01:00,75423,5.368,True,Business Development
973,Russell,Male,2013-05-10,2020-03-25 23:08:00,137359,11.105,False,Business Development
974,Harry,Male,2011-08-30,2020-03-25 18:31:00,67656,16.455,True,Client Services
975,Susan,Female,1995-04-07,2020-03-25 22:05:00,92436,12.467,False,Sales
976,Denise,Female,1992-10-19,2020-03-25 05:42:00,137954,4.195,True,Legal
977,Sarah,Female,1995-12-04,2020-03-25 09:16:00,124566,5.949,False,Product
978,Sean,Male,1983-01-17,2020-03-25 14:23:00,66146,11.178,False,Human Resources
979,Ernest,Male,2013-07-20,2020-03-25 06:41:00,142935,13.198,True,Product
980,Kimberly,Female,2013-01-26,2020-03-25 00:57:00,46233,8.862,True,Engineering
981,James,Male,1993-01-15,2020-03-25 17:19:00,148985,19.280,False,Legal
982,Rose,Female,1982-04-06,2020-03-25 10:43:00,91411,8.639,True,Human Resources
983,John,Male,1982-12-23,2020-03-25 22:35:00,146907,11.738,False,Engineering
984,Maria,Female,2011-10-15,2020-03-25 16:53:00,43455,13.040,False,Engineering
986,Donna,Female,1982-11-26,2020-03-25 07:04:00,82871,17.999,False,Marketing
987,Gloria,Female,2014-12-08,2020-03-25 05:08:00,136709,10.331,True,Finance
988,Alice,Female,2004-10-05,2020-03-25 09:34:00,47638,11.209,False,Human Resources
990,Robin,Female,1987-07-24,2020-03-25 13:35:00,100765,10.982,True,Client Services
991,Rose,Female,2002-08-25,2020-03-25 05:12:00,134505,11.051,True,Marketing
992,Anthony,Male,2011-10-16,2020-03-25 08:35:00,112769,11.625,True,Finance
993,Tina,Female,1997-05-15,2020-03-25 15:53:00,56450,19.040,True,Engineering
994,George,Male,2013-06-21,2020-03-25 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2020-03-25 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2020-03-25 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2020-03-25 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2020-03-25 18:24:00,129949,10.169,True,Sales

In [7]:
mask1 = df["Salary"].between(60000, 70000)
df[mask1]

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
1,Thomas,Male,1996-03-31,2020-03-25 06:53:00,61933,4.170,True,NaN
6,Ruby,Female,1987-08-17,2020-03-25 16:20:00,65476,10.012,True,Product
10,Louise,Female,1980-08-12,2020-03-25 09:01:00,63241,15.132,True,NaN
20,Lois,NaN,1995-04-22,2020-03-25 19:18:00,64714,4.934,True,Legal
41,Christine,NaN,2015-06-28,2020-03-25 01:08:00,66582,11.308,True,Business Development
47,Kathy,Female,2005-06-22,2020-03-25 04:51:00,66820,9.000,True,Client Services
57,Henry,Male,1996-06-26,2020-03-25 01:44:00,64715,15.107,True,Human Resources
59,Irene,Female,1997-05-07,2020-03-25 09:32:00,66851,11.279,False,Engineering
65,Steve,Male,2009-11-11,2020-03-25 23:44:00,61310,12.428,True,Distribution
74,Thomas,Male,1995-06-04,2020-03-25 14:24:00,62096,17.029,False,Marketing
88,Donna,Female,1991-11-27,2020-03-25 13:59:00,64088,6.155,True,Legal
101,Aaron,Male,2012-02-17,2020-03-25 10:20:00,61602,11.849,True,Marketing
107,Steven,Male,2013-04-23,2020-03-25 22:12:00,68680,16.565,False,Legal
112,Willie,Male,2003-11-27,2020-03-25 06:21:00,64363,4.023,False,Marketing
127,William,Male,2002-09-29,2020-03-25 16:09:00,66521,5.830,False,Human Resources
129,Antonio,Male,1988-10-25,2020-03-25 13:50:00,60866,13.101,True,Business Development
159,James,NaN,1983-11-22,2020-03-25 22:52:00,68501,14.316,False,Marketing
179,Jessica,Female,1995-10-23,2020-03-25 05:53:00,68759,19.343,True,Finance
196,Steven,Male,1985-11-10,2020-03-25 10:53:00,62719,19.127,False,Client Services
197,Carolyn,Female,2012-11-06,2020-03-25 03:51:00,69268,3.031,False,Client Services
225,Harry,Male,2015-10-01,2020-03-25 19:47:00,64579,15.266,True,Sales
231,Diane,Female,1993-04-18,2020-03-25 03:22:00,64084,17.018,False,Product
239,Lillian,NaN,2016-05-12,2020-03-25 15:43:00,64164,17.612,False,Human Resources
262,Anne,Female,1986-07-16,2020-03-25 14:08:00,69134,3.723,True,Engineering
285,Judy,Female,1997-09-16,2020-03-25 00:10:00,65931,2.304,False,Human Resources
286,Todd,Male,1984-02-02,2020-03-25 10:13:00,69989,10.985,True,Finance
288,Walter,NaN,1999-12-21,2020-03-25 22:33:00,66757,18.099,False,Distribution
310,Harold,Male,1990-02-20,2020-03-25 23:00:00,66775,2.158,True,Legal
320,NaN,Female,2008-07-08,2020-03-25 23:40:00,62960,14.356,True,Sales
325,Russell,Male,2005-01-02,2020-03-25 01:48:00,60388,17.885,False,Client Services
...,...,...,...,...,...,...,...,...
580,Harry,Male,1985-01-27,2020-03-25 20:18:00,65482,18.089,False,NaN
597,Teresa,Female,1987-06-24,2020-03-25 19:37:00,69740,8.294,False,Distribution
612,Julie,NaN,2000-10-21,2020-03-25 01:15:00,60361,7.099,True,Distribution
613,Teresa,NaN,1992-01-03,2020-03-25 15:47:00,63103,11.378,False,Finance
614,Eric,Male,2004-11-12,2020-03-25 21:16:00,65168,11.513,False,Distribution
618,Peter,Male,1992-11-24,2020-03-25 17:43:00,69297,1.268,False,Finance
654,Carl,Male,1984-12-14,2020-03-25 20:49:00,63395,11.411,False,Legal
668,James,Male,2001-12-05,2020-03-25 07:06:00,67789,17.105,True,Legal
677,Jacqueline,Female,1994-09-20,2020-03-25 18:07:00,62371,15.770,True,Client Services
679,Lori,Female,2002-09-11,2020-03-25 07:36:00,66029,3.345,True,Client Services
704,Thomas,Male,1991-09-07,2020-03-25 09:51:00,65251,11.211,False,Distribution
709,NaN,Male,1995-04-07,2020-03-25 04:32:00,60411,12.048,True,Human Resources
719,John,Male,1999-01-29,2020-03-25 03:07:00,67165,13.001,False,Engineering
730,Nicole,Female,2009-04-26,2020-03-25 00:40:00,66047,18.674,True,Marketing
742,Martin,Male,2016-02-25,2020-03-25 18:29:00,61117,2.844,False,Client Services
745,James,Male,2008-02-16,2020-03-25 02:49:00,69111,14.625,True,Business Development
747,Ernest,Male,2001-06-30,2020-03-25 13:46:00,61181,16.559,False,Business Development
825,Robert,NaN,2000-12-04,2020-03-25 01:20:00,69267,5.890,True,Sales
831,Kenneth,Male,2015-01-15,2020-03-25 14:41:00,69112,7.588,True,Finance
854,Harry,Male,1985-02-10,2020-03-25 19:46:00,63046,10.411,False,Finance
892,Brandon,Male,1995-10-23,2020-03-25 12:04:00,60263,2.709,False,Sales
909,Donald,Male,1991-08-01,2020-03-25 02:25:00,61999,6.466,False,Product
924,Deborah,Female,2003-11-11,2020-03-25 16:53:00,60003,9.624,False,Client Services
937,Aaron,NaN,1986-01-22,2020-03-25 19:39:00,63126,18.424,False,Client Services
943,Wayne,Male,2006-09-08,2020-03-25 11:09:00,67471,2.728,False,Engineering
965,Catherine,Female,1989-09-25,2020-03-25 01:31:00,68164,18.393,False,Client Services
970,Alice,Female,1988-09-03,2020-03-25 20:54:00,63571,15.397,True,Product
974,Harry,Male,2011-08-30,2020-03-25 18:31:00,67656,16.455,True,Client Services
978,Sean,Male,1983-01-17,2020-03-25 14:23:00,66146,11.178,False,Human Resources
998,Larry,Male,2013-04-20,2020-03-25 16:45:00,60500,11.985,False,Business Development

### The `.drop_duplicates()`, `.unique()` and `.nunique()` Methods

In [1]:
import pandas as pd
df = pd.read_csv("employees.csv", parse_dates = ["Start Date", "Last Login Time"])
df["Senior Management"] = df["Senior Management"].astype("bool")
df["Gender"] = df["Gender"].astype("category")
df.sort_values("First Name", inplace = True)
df.head(3)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
101,Aaron,Male,2012-02-17,2020-03-26 10:20:00,61602,11.849,True,Marketing
327,Aaron,Male,1994-01-29,2020-03-26 18:48:00,58755,5.097,True,Marketing
440,Aaron,Male,1990-07-22,2020-03-26 14:53:00,52119,11.343,True,Client Services

In [39]:
df.drop_duplicates(subset = ["First Name"], keep = False)

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
8,Angela,Female,2005-11-22,2020-02-13 06:29:00,95570,18.523,True,Engineering
688,Brian,Male,2007-04-07,2020-02-13 22:47:00,93901,17.821,True,Legal
190,Carol,Female,1996-03-19,2020-02-13 03:39:00,57783,9.129,False,Finance
887,David,Male,2009-12-05,2020-02-13 08:48:00,92242,15.407,False,Legal
5,Dennis,Male,1987-04-18,2020-02-13 01:35:00,115163,10.125,False,Legal
495,Eugene,Male,1984-05-24,2020-02-13 10:54:00,81077,2.117,False,Sales
33,Jean,Female,1993-12-18,2020-02-13 09:07:00,119082,16.180,False,Business Development
832,Keith,Male,2003-02-12,2020-02-13 15:02:00,120672,19.467,False,Legal
291,Tammy,Female,1984-11-11,2020-02-13 10:30:00,132839,17.463,True,Client Services

In [41]:
df["Gender"].unique()

[Male, NaN, Female]
Categories (2, object): [Male, Female]

In [3]:
len(df["Team"].unique())

11

In [6]:
df["Team"].nunique(dropna = False)

11

### The `.set_index()` and `.reset_index()` Methods

In [20]:
import pandas as pd
bond = pd.read_csv("jamesbond.csv")
bond.head(3)

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [14]:
bond.set_index("Film", inplace = True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [15]:
bond.reset_index(drop = False, inplace = True)
bond.head(3)

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [21]:
bond.set_index("Film", inplace = True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [22]:
bond.set_index("Year", inplace = True)
bond.head(3)

             Actor       Director  Box Office  Budget  Bond Actor Salary
Year
1962  Sean Connery  Terence Young       448.8     7.0                0.6
1963  Sean Connery  Terence Young       543.8    12.6                1.6
1964  Sean Connery   Guy Hamilton       820.4    18.6                3.2

In [ ]:
bond.set_index("Film", inplace = True)
bond.reset_index(inplace = True)
bond.set_index("Year", inplace = True)
bond.head(3)

### Retrieve Rows by Index Label with `.loc[]`

In [2]:
import pandas as pd
bond = pd.read_csv("jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [3]:
bond.loc["Goldfinger"]
bond.loc["GoldenEye"]
#bond.loc["Sacred Bond"]
bond.loc["Casino Royale"]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [4]:
bond.loc["Diamonds Are Forever" : "Moonraker"]
bond.loc[: "On Her Majesty's Secret Service"]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,NaN
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5.1
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,NaN
Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,NaN
Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,NaN
Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7.8
On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6

In [5]:
bond.loc[["Octopussy", "Moonraker"]]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7.8
Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,NaN

In [6]:
bond.loc[["For Your Eyes Only", "Live and Let Die", "Gold Bond"]]

/srv/conda/envs/notebook/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike
  """Entry point for launching an IPython kernel.

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
For Your Eyes Only,1981.0,Roger Moore,John Glen,449.4,60.2,NaN
Live and Let Die,1973.0,Roger Moore,Guy Hamilton,460.3,30.8,NaN
Gold Bond,NaN,NaN,NaN,NaN,NaN,NaN

In [7]:
"Gold Bond" in bond.index

False

### Retrieve Row(s) by Index Position with `iloc`

In [8]:
bond = pd.read_csv("jamesbond.csv")
bond.head(3)

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
0,Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
1,From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
2,Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [9]:
bond.loc[15]
bond.iloc[15]

bond.iloc[[15, 20]]
bond.iloc[:4]
bond.iloc[4:8]
bond.iloc[20:]

,Film,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
20,The World Is Not Enough,1999,Pierce Brosnan,Michael Apted,439.5,158.3,13.5
21,Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
22,Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
23,Quantum of Solace,2008,Daniel Craig,Marc Forster,514.2,181.4,8.1
24,Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14.5
25,Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,NaN

In [10]:
bond = pd.read_csv("jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [11]:
bond.iloc[[5, 10, 15, 20]]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6
The Man with the Golden Gun,1974,Roger Moore,Guy Hamilton,334.0,27.7,NaN

### Retrive rows by `.ix[]` Method

In [17]:
bond = pd.read_csv("jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head(10)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,NaN
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5.1
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [21]:
bond.ix["GoldenEye"]
bond.ix[["GoldenEye", "Diamonds Are Forever", "Casino Royale"]]
bond.ix["A View to a Kill" : "Diamonds Are Forever"]
# bond.ix["Sacred Bond"]

#"Spectre" in bond.index
#"Sacred Bond" in bond.index

/srv/conda/envs/notebook/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
/srv/conda/envs/notebook/lib/python3.7/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

/srv/conda/envs/notebook/lib/python3.7/site-packages/ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8

In [22]:
bond = pd.read_csv("jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [23]:
bond.loc["Moonraker", ["Actor", "Budget", "Year"]]

bond.iloc[14, [5, 3, 2]]

bond.ix[20, "Budget"]
bond.ix["The Man with the Golden Gun", :4]
bond.ix[5, 3]

/srv/conda/envs/notebook/lib/python3.7/site-packages/ipykernel_launcher.py:5: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """
/srv/conda/envs/notebook/lib/python3.7/site-packages/ipykernel_launcher.py:6: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

/srv/conda/envs/notebook/lib/python3.7/site-packages/ipykernel_launcher.py:7: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  import sys

448.8

### Set New Values for a Specific Cell or Row

In [16]:
bond = pd.read_csv("jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [17]:
bond.ix["A View to a Kill"]

/srv/conda/envs/notebook/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

Year                        1985
Actor                Roger Moore
Director               John Glen
Box Office                 275.2
Budget                      54.5
Bond Actor Salary            9.1
Name: A View to a Kill, dtype: object

In [19]:
bond.ix["A View to a Kill", "Actor"] = "Sir Sean Connery"
bond.head(3)

/srv/conda/envs/notebook/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Sir Sean Connery,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [20]:
bond.ix["A View to a Kill", ["Box Office", "Budget", "Bond Actor Salary"]] = [448800000, 7000000, 600000]

/srv/conda/envs/notebook/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [21]:
bond.ix["A View to a Kill", "Budget"]

/srv/conda/envs/notebook/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

7000000.0

### Set Multiple Values in `DataFrame`

In [13]:
bond = pd.read_csv("jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [30]:
mask = bond["Actor"] == "Sean Connery"

In [34]:
bond.ix[mask, "Actor"] = "Sir Sean Connery"
bond.head(5)

/srv/conda/envs/notebook/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Diamonds Are Forever,1971,Sir Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9

### Rename Index Labels or Columns in a `DataFrame`

In [40]:
import pandas as pd
bond = pd.read_csv("jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [41]:
bond.rename(columns = {"Year" : "Release Date", "Box Office" : "Revenue"}, inplace = True)
bond.head(3)

,Release Date,Actor,Director,Revenue,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [42]:
bond.rename(index = {"Dr. No" : "Doctor No", 
                     "GoldenEye" : "Golden Eye",
                    "The World Is Not Enough" : "Best Bond Movie Ever"}, inplace = True)
bond.head(3)

,Release Date,Actor,Director,Revenue,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

### Delete Rows or Columns from a `DataFrame`

In [23]:
import pandas as pd
bond = pd.read_csv("jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [16]:
bond.drop("Casino Royale", inplace = True)
bond.head(10)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,NaN
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5.1
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,NaN

In [17]:
bond.drop(labels = ["Box Office", "Bond Actor Salary", "Actor"], axis = "columns", inplace = True)
bond.head(3)

                      Year      Director  Budget
Film
A View to a Kill      1985     John Glen    54.5
Diamonds Are Forever  1971  Guy Hamilton    34.7
Die Another Day       2002  Lee Tamahori   154.2

In [19]:
actor = bond.pop("Actor")

In [20]:
actor

Film
A View to a Kill                      Roger Moore
Casino Royale                        Daniel Craig
Casino Royale                         David Niven
Diamonds Are Forever                 Sean Connery
Die Another Day                    Pierce Brosnan
Dr. No                               Sean Connery
For Your Eyes Only                    Roger Moore
From Russia with Love                Sean Connery
GoldenEye                          Pierce Brosnan
Goldfinger                           Sean Connery
Licence to Kill                    Timothy Dalton
Live and Let Die                      Roger Moore
Moonraker                             Roger Moore
Never Say Never Again                Sean Connery
Octopussy                             Roger Moore
On Her Majesty's Secret Service    George Lazenby
Quantum of Solace                    Daniel Craig
Skyfall                              Daniel Craig
Spectre                              Daniel Craig
The Living Daylights               Timothy Dalton
The Man with the Golden Gun           Roger Moore
The Spy Who Loved Me                  Roger Moore
The World Is Not Enough            Pierce Brosnan
Thunderball                          Sean Connery
Tomorrow Never Dies                Pierce Brosnan
You Only Live Twice                  Sean Connery
Name: Actor, dtype: object

In [24]:
del bond["Director"]
bond.head(3)

                  Year         Actor  Box Office  Budget  Bond Actor Salary
Film
A View to a Kill  1985   Roger Moore       275.2    54.5                9.1
Casino Royale     2006  Daniel Craig       581.5   145.3                3.3
Casino Royale     1967   David Niven       315.0    85.0                NaN

### The `.nsmallest()` and `.nlargest()` Methods

In [25]:
bond = pd.read_csv("jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [26]:
bond.sort_values("Box Office", ascending = False).head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14.5
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [27]:
bond.nlargest(3, columns = "Box Office")

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14.5
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2

In [28]:
bond.nsmallest(n = 2, columns = "Box Office")

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1

### Filtering with the `where` Method

In [1]:
import pandas as pd
bond = pd.read_csv("jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [2]:
mask = bond["Actor"] == "Sean Connery"
bond[mask]

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,NaN
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4.4

In [3]:
bond.where(mask)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,NaN,NaN,NaN,NaN,NaN,NaN
Casino Royale,NaN,NaN,NaN,NaN,NaN,NaN
Casino Royale,NaN,NaN,NaN,NaN,NaN,NaN
Diamonds Are Forever,1971.0,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,NaN,NaN,NaN,NaN,NaN,NaN
Dr. No,1962.0,Sean Connery,Terence Young,448.8,7.0,0.6
For Your Eyes Only,NaN,NaN,NaN,NaN,NaN,NaN
From Russia with Love,1963.0,Sean Connery,Terence Young,543.8,12.6,1.6
GoldenEye,NaN,NaN,NaN,NaN,NaN,NaN
Goldfinger,1964.0,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Licence to Kill,NaN,NaN,NaN,NaN,NaN,NaN
Live and Let Die,NaN,NaN,NaN,NaN,NaN,NaN
Moonraker,NaN,NaN,NaN,NaN,NaN,NaN
Never Say Never Again,1983.0,Sean Connery,Irvin Kershner,380.0,86.0,NaN
Octopussy,NaN,NaN,NaN,NaN,NaN,NaN
On Her Majesty's Secret Service,NaN,NaN,NaN,NaN,NaN,NaN
Quantum of Solace,NaN,NaN,NaN,NaN,NaN,NaN
Skyfall,NaN,NaN,NaN,NaN,NaN,NaN
Spectre,NaN,NaN,NaN,NaN,NaN,NaN
The Living Daylights,NaN,NaN,NaN,NaN,NaN,NaN
The Man with the Golden Gun,NaN,NaN,NaN,NaN,NaN,NaN
The Spy Who Loved Me,NaN,NaN,NaN,NaN,NaN,NaN
The World Is Not Enough,NaN,NaN,NaN,NaN,NaN,NaN
Thunderball,1965.0,Sean Connery,Terence Young,848.1,41.9,4.7
Tomorrow Never Dies,NaN,NaN,NaN,NaN,NaN,NaN
You Only Live Twice,1967.0,Sean Connery,Lewis Gilbert,514.2,59.9,4.4

### The `.query()` Method

In [4]:
bond = pd.read_csv("jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [5]:
#bond.columns = [column_name.replace(" ", "_") for column_name in bond.columns]
#bond.head(1)

,Year,Actor,Director,Box_Office,Budget,Bond_Actor_Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1

In [6]:
bond.query('Actor == "Sean Connery"')
bond.query("Actor != 'Roger Moore'")

,Year,Actor,Director,Box_Office,Budget,Bond_Actor_Salary
Film,,,,,,
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Diamonds Are Forever,1971,Sean Connery,Guy Hamilton,442.5,34.7,5.8
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
Dr. No,1962,Sean Connery,Terence Young,448.8,7.0,0.6
From Russia with Love,1963,Sean Connery,Terence Young,543.8,12.6,1.6
GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5.1
Goldfinger,1964,Sean Connery,Guy Hamilton,820.4,18.6,3.2
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
Never Say Never Again,1983,Sean Connery,Irvin Kershner,380.0,86.0,NaN
On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6
Quantum of Solace,2008,Daniel Craig,Marc Forster,514.2,181.4,8.1
Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14.5
Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,NaN
The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5.2
The World Is Not Enough,1999,Pierce Brosnan,Michael Apted,439.5,158.3,13.5
Thunderball,1965,Sean Connery,Terence Young,848.1,41.9,4.7
Tomorrow Never Dies,1997,Pierce Brosnan,Roger Spottiswoode,463.2,133.9,10.0
You Only Live Twice,1967,Sean Connery,Lewis Gilbert,514.2,59.9,4.4

In [7]:
bond.query("Actor == 'Roger Moore' or Director == 'John Glen'")

,Year,Actor,Director,Box_Office,Budget,Bond_Actor_Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
For Your Eyes Only,1981,Roger Moore,John Glen,449.4,60.2,NaN
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
Live and Let Die,1973,Roger Moore,Guy Hamilton,460.3,30.8,NaN
Moonraker,1979,Roger Moore,Lewis Gilbert,535.0,91.5,NaN
Octopussy,1983,Roger Moore,John Glen,373.8,53.9,7.8
The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5.2
The Man with the Golden Gun,1974,Roger Moore,Guy Hamilton,334.0,27.7,NaN
The Spy Who Loved Me,1977,Roger Moore,Lewis Gilbert,533.0,45.1,NaN

In [8]:
bond.query("Actor not in ['Sean Connery', 'Roger Moore']")

,Year,Actor,Director,Box_Office,Budget,Bond_Actor_Salary
Film,,,,,,
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN
Die Another Day,2002,Pierce Brosnan,Lee Tamahori,465.4,154.2,17.9
GoldenEye,1995,Pierce Brosnan,Martin Campbell,518.5,76.9,5.1
Licence to Kill,1989,Timothy Dalton,John Glen,250.9,56.7,7.9
On Her Majesty's Secret Service,1969,George Lazenby,Peter R. Hunt,291.5,37.3,0.6
Quantum of Solace,2008,Daniel Craig,Marc Forster,514.2,181.4,8.1
Skyfall,2012,Daniel Craig,Sam Mendes,943.5,170.2,14.5
Spectre,2015,Daniel Craig,Sam Mendes,726.7,206.3,NaN
The Living Daylights,1987,Timothy Dalton,John Glen,313.5,68.8,5.2
The World Is Not Enough,1999,Pierce Brosnan,Michael Apted,439.5,158.3,13.5
Tomorrow Never Dies,1997,Pierce Brosnan,Roger Spottiswoode,463.2,133.9,10.0

### `.apply()` Method on Single Columns

In [9]:
bond = pd.read_csv("jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [10]:
def convert_to_string_and_add_millions(number):
    return str(number) + " MILLIONS!"

In [11]:
columns = ["Box Office", "Budget", "Bond Actor Salary"]
for col in columns:
    bond[col] = bond[col].apply(convert_to_string_and_add_millions)

In [12]:
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2 MILLIONS!,54.5 MILLIONS!,9.1 MILLIONS!
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5 MILLIONS!,145.3 MILLIONS!,3.3 MILLIONS!
Casino Royale,1967,David Niven,Ken Hughes,315.0 MILLIONS!,85.0 MILLIONS!,nan MILLIONS!

### The `.copy()` Method

In [4]:
bond = pd.read_csv("jamesbond.csv", index_col = "Film")
bond.sort_index(inplace = True)
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [5]:
directors = bond["Director"]
directors.head(3)

Film
A View to a Kill          John Glen
Casino Royale       Martin Campbell
Casino Royale            Ken Hughes
Name: Director, dtype: object

In [6]:
directors["A View to a Kill"] = "Mister John Glen"

/srv/conda/envs/notebook/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [7]:
directors.head(3)

Film
A View to a Kill    Mister John Glen
Casino Royale        Martin Campbell
Casino Royale             Ken Hughes
Name: Director, dtype: object

In [8]:
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,Mister John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

In [9]:
directors = bond["Director"].copy()
directors.head(3)

Film
A View to a Kill    Mister John Glen
Casino Royale        Martin Campbell
Casino Royale             Ken Hughes
Name: Director, dtype: object

In [10]:
directors["A View to a Kill"] = "Mister John Glen"

In [11]:
directors.head(3)

Film
A View to a Kill    Mister John Glen
Casino Royale        Martin Campbell
Casino Royale             Ken Hughes
Name: Director, dtype: object

In [12]:
bond.head(3)

,Year,Actor,Director,Box Office,Budget,Bond Actor Salary
Film,,,,,,
A View to a Kill,1985,Roger Moore,Mister John Glen,275.2,54.5,9.1
Casino Royale,2006,Daniel Craig,Martin Campbell,581.5,145.3,3.3
Casino Royale,1967,David Niven,Ken Hughes,315.0,85.0,NaN

## Working with Text Data

In [13]:
import pandas as pd
data=[[' Anil',90,'A','very good'],['Basanti ',89,'A-','Good'],[' Charan ',70,'B-','Average'],['Dolly',40,'D+','Below Avereage'],
      ['Emily',68,'B-','Average'],['Anil',99,'A+','Awesome'],['Charan',29,'F','Bad'],['Charan',55,'C+','Below Average']]
df=pd.DataFrame(data,columns=['StudentName','Marks','Grade','Remarks'])
df

  StudentName  Marks Grade         Remarks
0        Anil     90     A       very good
1    Basanti      89    A-            Good
2     Charan      70    B-         Average
3       Dolly     40    D+  Below Avereage
4       Emily     68    B-         Average
5        Anil     99    A+         Awesome
6      Charan     29     F             Bad
7      Charan     55    C+   Below Average

In [2]:
df['StudentName'].nunique()

5

In [3]:
df['StudentName'].count()

8

### `lower()`, `upper()`, `title()` and `len()` methods

In [4]:
df['StudentName'].str.lower()

0       anil
1    basanti
2     charan
3      dolly
4      emily
5       anil
6     charan
7     charan
Name: StudentName, dtype: object

In [5]:
df['StudentName'].str.upper()

0       ANIL
1    BASANTI
2     CHARAN
3      DOLLY
4      EMILY
5       ANIL
6     CHARAN
7     CHARAN
Name: StudentName, dtype: object

In [8]:
df['Remarks'].str.title()

0         Very Good
1              Good
2           Average
3    Below Avereage
4           Average
5           Awesome
6               Bad
7     Below Average
Name: Remarks, dtype: object

In [9]:
df['StudentName'].str.len()

0    4
1    7
2    6
3    5
4    5
5    4
6    6
7    6
Name: StudentName, dtype: int64

### `.str.replace() , .strip(), .lstrip() , rstrip() and split()` methods

In [11]:
df["Remarks"].str.replace(" ","_")

0         very_good
1              Good
2           Average
3    Below_Avereage
4           Average
5           Awesome
6               Bad
7     Below_Average
Name: Remarks, dtype: object

In [14]:
df["StudentName"].str.strip()

0       Anil
1    Basanti
2     Charan
3      Dolly
4      Emily
5       Anil
6     Charan
7     Charan
Name: StudentName, dtype: object

In [15]:
df["Remarks"].str.split(" ").str.get(0)

0       very
1       Good
2    Average
3      Below
4    Average
5    Awesome
6        Bad
7      Below
Name: Remarks, dtype: object